emacs-lisp-tutorial.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Learn Emacs Lisp while customizing Emacs</title>
<!-- 2014-04-22 Tue 18:15 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Sacha Chua" />
<link rel="stylesheet" type="text/css" href="http://sachachua.com/blog/wp-content/themes/sacha-v3/foundation/css/foundation.min.css"></link>
<link rel="stylesheet" type="text/css" href="http://sachachua.com/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="http://sachachua.com/blog/wp-content/themes/sacha-v3/style.css"></link>
</head>
<body>
<div id="preamble" class="status">
<a name="top" id="top"></a>
</div>
<div id="content">
<h1 class="title">Learn Emacs Lisp while customizing Emacs</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Why learn Emacs Lisp?</a></li>
<li><a href="#sec-2">How to run Emacs Lisp code</a></li>
<li><a href="#sec-3">How to save your configuration</a></li>
<li><a href="#sec-4">How to load modes to change the way that Emacs behaves</a></li>
<li><a href="#sec-5">How to specify options when you're calling functions</a></li>
<li><a href="#sec-6">How to set simple variables</a></li>
<li><a href="#sec-7">How to set buffer-local variables</a></li>
<li><a href="#sec-8">How to set more complex variables</a></li>
<li><a href="#sec-9">How to load libraries</a></li>
<li><a href="#sec-10">How to add to lists</a></li>
<li><a href="#sec-11">How to add package archives - to be written</a></li>
<li><a href="#sec-12">How to add hooks - to be written</a></li>
<li><a href="#sec-13">How to set up your own keybord shortcuts - to be written</a></li>
<li><a href="#sec-14">How to define your own functions - to be written</a></li>
<li><a href="#sec-15">How to prompt for information - to be written</a></li>
<li><a href="#sec-16">How to change existing functions with advice - to be written</a></li>
</ul>
</div>
</div>
<p>
Work in progress. Questions/ideas? <a href="mailto:sacha@sachachua.com">sacha@sachachua.com</a>
</p>

<p>
Available at <a href="http://sach.ac/baby-steps-elisp">http://sach.ac/baby-steps-elisp</a> <br  />
Github: <a href="https://github.com/sachac/emacs-notes">https://github.com/sachac/emacs-notes</a> . Patches welcome. =)
</p>

<p>
While I'm drafting this, you may want to check out the following resources:  
</p>

<ul class="org-ul">
<li><a href="http://bzg.fr/learn-emacs-lisp-in-15-minutes.html">http://bzg.fr/learn-emacs-lisp-in-15-minutes.html</a>
</li>
<li><a href="http://toumorokoshi.github.io/emacs-from-scratch-part-3-extending-emacs-with-elisp.html">http://toumorokoshi.github.io/emacs-from-scratch-part-3-extending-emacs-with-elisp.html</a>
</li>
<li><a href="https://www.gnu.org/software/emacs/manual/html_mono/eintr.html">An Introduction to Programming in Emacs Lisp</a>: A bit abstract, but a good place to start. Read it even if you don't understand everything. Read it again. Refer to it frequently. Graduate to the <a href="http://www.gnu.org/software/emacs/manual/elisp.html">Emacs Lisp reference manual</a> when you're more comfortable (or if you need to look up details).
</li>
<li><a href="http://ergoemacs.org/emacs/elisp.html">http://ergoemacs.org/emacs/elisp.html</a>: Good collection of idioms and common uses.
</li>
<li><a href="http://joelmccracken.github.io/entries/emacs-lisp-for-hackers-part-1-lisp-essentials/">http://joelmccracken.github.io/entries/emacs-lisp-for-hackers-part-1-lisp-essentials/</a>: Starts with ielm, focuses on data structures; other parts?
</li>
<li><a href="http://cjohansen.no/an-introduction-to-elisp">http://cjohansen.no/an-introduction-to-elisp</a>: Focuses on Emacs Lisp as a way of extending Emacs, uses programming examples (test cases)
</li>
<li><a href="http://steve-yegge.blogspot.com/2008/01/emergency-elisp.html">http://steve-yegge.blogspot.com/2008/01/emergency-elisp.html</a>
</li>
</ul>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Why learn Emacs Lisp?</h2>
<div class="outline-text-2" id="text-1">
<p>
Emacs is amazingly customizable. If you want to tweak Emacs to support the way that you'd like to work, learning Emacs Lisp will definitely pay off. People have used Emacs Lisp to turn Emacs into a musical instrument, a TODO manager, a webserver, and all sorts of other things.
</p>

<p>
You don't need to be a programmer in order to learn and use Emacs Lisp. Even though you'll technically be programming in it, just think of it as configuring Emacs. This guide will start you off with simple customizations, and then you can go from there. In this guide, you'll be changing options much like you might change them through other applications' Options dialog. It's just that in Emacs, it's easier to do most things in text.
</p>

<p>
In addition to reading this guide, you may want to check out <a href="http://planet.emacsen.org">Planet Emacsen</a> and <a href="http://www.emacswiki.org">Emacs Wiki</a> for plenty of inspiration. Seeing what other people have done with Emacs can nudge you to explore more of the Emacs Lisp code that makes it possible.
</p>

<p>
I'm going to assume that you've already installed Emacs 24 or later and that you're familiar with basic editing. If you haven't gone through the tutorial yet, you can click on the tutorial link that appears when Emacs starts up, or you can use <code>Ctrl-h t</code> (<code>help-with-tutorial</code>). All right. Let's start!
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">How to run Emacs Lisp code</h2>
<div class="outline-text-2" id="text-2">
<p>
The first thing you need to learn is how to run Emacs Lisp. By default, Emacs starts up with a <code>*scratch*</code> buffer that's in Emacs Lisp mode. You can use this to try out code temporarily without saving it to your config. Type or paste in the code that you want to try, then use <code>M-x eval-buffer</code> to evaluate all the code in that buffer.
</p>

<p>
If you want to run some of the code (but not all the code), you can select the region and then type <code>M-x eval-region</code>. 
</p>

<p>
Emacs Lisp code is made up of expressions that are enclosed in sets of parentheses. To run just one expression, put your cursor right after the last parenthesis (but not on the parenthesis itself). Type <code>C-x C-e</code> (<code>eval-last-sexp</code>). You should see the results that expression.
</p>

<p>
Let's try that with some examples. Type or copy the following into your <code>*scratch*</code> buffer and use <code>M-x eval-buffer</code>. It should show "Hello world" in the echo area near the bottom of your Emacs frame.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(message <span class="org-string">"Hello world"</span>)
</pre>
</div>

<p>
Try <code>M-x eval-region</code> and <code>C-x C-e</code> (<code>eval-last-sexp</code>) as well.
</p>

<p>
There are a few other ways to quickly evaluate Emacs Lisp code. If you just want to quickly evaluate something, try <code>M-:</code> (<code>eval-expression</code>). <code>M-x ielm</code> opens an interactive buffer where you can type code and then press <code>RET</code> (Enter). When you're starting out, you'll probably want to be able to easily read and modify the code, so I suggest using <code>M-x eval-buffer</code>, <code>M-x eval-region</code>, or <code>C-x C-e</code> (<code>eval-last-sexp</code>) instead. If you've downloaded <code>emacs-lisp-tutorial.org</code> and are reading this in Emacs, you can evaluate code by putting your text cursor on the <code>#+begin_src emacs-lisp</code> line and typing <code>C-c C-c</code>. Make sure to re-evaluate it if you make any changes. Might be handy.
</p>

<p>
Since the <code>*scratch*</code> buffer is not automatically saved to a file, you may want to put your code into a file instead. You can create any file with the <code>.el</code> extension (ex: <code>test.el</code>) and Emacs will switch to Emacs Lisp mode when you open it.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">How to save your configuration</h2>
<div class="outline-text-2" id="text-3">
<p>
When you like something and you want to make it part of your configuration, open the file <code>~/.emacs.d/init.el</code>. If you started with an older version of Emacs and have a <code>~/.emacs</code> file instead, be sure to move its contents to <code>~/.emacs.d/init.el</code> and remove the <code>~/.emacs</code> file.
</p>

<p>
It's usually safe to add your new code to the bottom of the file. If your <code>init.el</code> already contains some code, make sure you add your new code after the last closing parenthesis. If you're changing things like <code>load-path</code>, you may want to put the code earlier in the file (before the library is loaded). Save your <code>init.el</code> and restart Emacs.
</p>

<p>
What if you added something to your <code>init.el</code> that caused an error when you started Emacs? Don't worry. You can find out which part caused the error with <code>emacs --debug-init</code>. You can also start Emacs without your configuration file by typing <code>emacs -q</code> at the command-line. Then you can open your <code>init.el</code>, remove the problematic line, and restart to see if that fixed it.
</p>

<p>
Okay, let's start writing Emacs Lisp!
</p>
</div>
</div>
