emacs-lisp-tutorial.org
** How to load modes to change the way that Emacs behaves

Emacs has "modes" that load different pieces of functionality. You've already seen how Emacs Lisp Mode (or =emacs-lisp-mode=, which is the actual name in Emacs Lisp) changes the color of code in the =*scratch*= buffer. Other modes affect how you use Emacs. Here's an example of a mode that you may find useful. It turns on completion for =M-x=.

#+begin_src emacs-lisp
(icomplete-mode)
#+end_src

Put that in your =*scratch*= and use =M-x eval-buffer= to evaluate it. Now try =M-x= again, and start typing =eval-buffer=. As you type, Emacs will suggest possible completions. There are even more [[http://sachachua.com/blog/2014/03/emacs-basics-call-commands-name-m-x-tips-better-completion-using-ido-helm/][shortcuts for M-x]], but this is probably a good start for you.

Here are some other modes that might be helpful:

#+begin_src emacs-lisp
(column-number-mode)
(visual-line-mode)
(global-hl-line-mode)
#+end_src

Try using =C-x C-e= (=eval-last-sexp=) to evaluate these lines one at a time. Put your cursor after the ending =)= on each line, then type =C-x C-e=.

=icomplete-mode= and the other modes are all examples of *functions*. The first "word" after the opening parenthesis of an Emacs Lisp expression is usually a function. You can learn more about functions with =F1 f= (=describe-function=). There are tons of functions in Emacs (and even more once you start installing and loading packages). You can discover useful functions by browsing through other people's configuration, looking at the source code of other functions you're interested in, checking out [[http://emacswiki.org][EmacsWiki]], asking on mailing lists and newsgroups, or using the =M-x apropos-command= function.

** How to specify options when you're calling functions

Some functions need more information. For example, =prefer-coding-system= is a useful function if you work with files that have special characters or different languages. The following Emacs Lisp code sets the default to UTF-8, which is a common standard.

#+begin_src emacs-lisp
(prefer-coding-system 'utf-8)
#+end_src

Here's another example. Let's say that you want to open a file whenever you start Emacs. The function to open a file is called =find-file=, and you can give it the name of the file to open. The code below looks for a file called "todo.org" in your home directory, and creating it if it does not yet exist.

#+begin_src emacs-lisp
(find-file "~/todo.org")
#+end_src

(See [[baby-steps-org][A Baby Steps Guide to Managing Your Tasks with Org]] for more info on Org files.)

Here's a third example, for when you get tired of typing "yes" or "no" to confirmation prompts:

#+begin_src emacs-lisp
(fset 'yes-or-no-p 'y-or-n-p)   
#+end_src

=fset= is a function that replaces a function (yes-or-no-p) with another function (y-or-n-p). Sounds complicated? A little. You can use the snippet right now without digging into how it works, and you'll learn more about functions over time.

** How to set simple variables

In addition to calling functions, you can also set values that affect what code does.
Many functions check the value of different *variables*. For example, this tells Emacs to keep old versions.

#+begin_src emacs-lisp
(setq delete-old-versions -1)
#+end_src

=setq= means "Set this quoted variable to this value." The quoted part just means that the first argument (in this case, =delete-old-versions=) is treated as a variable name instead of being used to look up a *different* variable to set. The code is the same as the code below:

#+begin_src emacs-lisp
(set (quote delete-old-versions) -1)
#+end_src

... but the =setq= version is shorter, so everyone uses that instead. This is also why you should be careful to type =setq= instead of =set=, as =set= refers to a different function. If you accidentally use =set= instead, you'll usually see something like a =Wrong type argument: symbolp=, /value/

To see the documentation for a variable, use =F1 v= (=describe-variable=) and type in the variable name. The variable name is the first argument to =setq=, so you would type in =F1 f delete-old-versions=. 

You can customize many variables through the =M-x customize= interface, but you'll most often see people sharing their configuration with Emacs Lisp code instead. It can be shorter to say "Add this code to your init.el" than it is to say "Use =M-x customize-variable= to change the =user-email-address= value", especially if there are lots of options to change. Not everything can be changed through the Customize interface, too. Emacs Lisp is more powerful, and it's easier to read afterwards. I tend to use =M-x customize= to explore, but I use Emacs Lisp code to set things up.

Like the way there are tons of functions, there are also tons of variables, and you can discover interesting variables using the same techniques: reading other people's code, exploring, etc. 

** How to set buffer-local variables
	 :LOGBOOK:
	 CLOCK: [2014-04-18 Fri 15:10]--[2014-04-18 Fri 15:17] =>  0:07
	 :END:
	 :PROPERTIES:
	 :Effort:   1:00
	 :END:

Some variables are *buffer-local*. This means that the value in one buffer (or file) is separate from the values in other buffers. To find out if a variable is local to a buffer, use =F1 v= (=describe-variable=) to look at the documentation for that variable. For example, the documentation for =tab-width= has "Automatically becomes buffer-local when set".

You can set the default value of a buffer-local variable with =setq-default=. The following code sets the tab width to 2 by default:

#+begin_src emacs-lisp
(setq-default tab-width 2)
#+end_src

#+BEGIN_COMMENT

You can also change global variables so that they're local to buffers, if you want to have different values in different files. There are two ways to do this. You can se

#+begin_src emacs-lisp
(make-local-variable ' 
#+end_src

Or you can make a variable buffer local wherever it's set:

#+begin_src emacs-lisp
(make-variable-buffer-local 
#+end_src

#+END_COMMENT 

** How to set more complex variables

Some variables contain lists of data. Here's an example:

#+begin_src emacs-lisp
(setq backup-directory-alist '(("." . "~/.emacs.d/backups")))
#+end_src

This is one of the things people usually want to change right away. By default, Emacs saves backup files in the current directory. These are the files ending in =~= that are cluttering up your directory lists. This code stashes them in =~/.emacs.d/backups=, where you can find them with =C-x C-f= (=find-file=) when you need to.

=alist= stands for *association list*. Each entry in the list is
enclosed in (...). The first part of the list is the key that is used
to look it up, like the way a dictionary has words. The second part of
the list is the value that Emacs uses, like the definitions in a dictionary.
If you're curious, the [[http://www.gnu.org/software/emacs/manual/html_node/elisp/Association-Lists.html][Emacs Lisp reference manual]] has more details.
