emacs-lisp-tutorial.html

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">How to load modes to change the way that Emacs behaves</h2>
<div class="outline-text-2" id="text-4">
<p>
Emacs has "modes" that load different pieces of functionality. You've already seen how Emacs Lisp Mode (or <code>emacs-lisp-mode</code>, which is the actual name in Emacs Lisp) changes the color of code in the <code>*scratch*</code> buffer. Other modes affect how you use Emacs. Here's an example of a mode that you may find useful. It turns on completion for <code>M-x</code>.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(icomplete-mode)
</pre>
</div>

<p>
Put that in your <code>*scratch*</code> and use <code>M-x eval-buffer</code> to evaluate it. Now try <code>M-x</code> again, and start typing <code>eval-buffer</code>. As you type, Emacs will suggest possible completions. There are even more <a href="http://sachachua.com/blog/2014/03/emacs-basics-call-commands-name-m-x-tips-better-completion-using-ido-helm/">shortcuts for M-x</a>, but this is probably a good start for you.
</p>

<p>
Here are some other modes that might be helpful:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(column-number-mode)
(visual-line-mode)
(global-hl-line-mode)
</pre>
</div>

<p>
Try using <code>C-x C-e</code> (<code>eval-last-sexp</code>) to evaluate these lines one at a time. Put your cursor after the ending <code>)</code> on each line, then type <code>C-x C-e</code>.
</p>

<p>
<code>icomplete-mode</code> and the other modes are all examples of <b>functions</b>. The first "word" after the opening parenthesis of an Emacs Lisp expression is usually a function. You can learn more about functions with <code>F1 f</code> (<code>describe-function</code>). There are tons of functions in Emacs (and even more once you start installing and loading packages). You can discover useful functions by browsing through other people's configuration, looking at the source code of other functions you're interested in, checking out <a href="http://emacswiki.org">EmacsWiki</a>, asking on mailing lists and newsgroups, or using the <code>M-x apropos-command</code> function.
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">How to specify options when you're calling functions</h2>
<div class="outline-text-2" id="text-5">
<p>
Some functions need more information. For example, <code>prefer-coding-system</code> is a useful function if you work with files that have special characters or different languages. The following Emacs Lisp code sets the default to UTF-8, which is a common standard.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(prefer-coding-system 'utf-8)
</pre>
</div>

<p>
Here's another example. Let's say that you want to open a file whenever you start Emacs. The function to open a file is called <code>find-file</code>, and you can give it the name of the file to open. The code below looks for a file called "todo.org" in your home directory, and creating it if it does not yet exist.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(find-file <span class="org-string">"~/todo.org"</span>)
</pre>
</div>

<p>
(See <i>A Baby Steps Guide to Managing Your Tasks with Org</i> for more info on Org files.)
</p>

<p>
Here's a third example, for when you get tired of typing "yes" or "no" to confirmation prompts:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(fset 'yes-or-no-p 'y-or-n-p)
</pre>
</div>

<p>
<code>fset</code> is a function that replaces a function (yes-or-no-p) with another function (y-or-n-p). Sounds complicated? A little. You can use the snippet right now without digging into how it works, and you'll learn more about functions over time.
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">How to set simple variables</h2>
<div class="outline-text-2" id="text-6">
<p>
In addition to calling functions, you can also set values that affect what code does.
Many functions check the value of different <b>variables</b>. For example, this tells Emacs to keep old versions.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq delete-old-versions -1)
</pre>
</div>

<p>
<code>setq</code> means "Set this quoted variable to this value." The quoted part just means that the first argument (in this case, <code>delete-old-versions</code>) is treated as a variable name instead of being used to look up a <b>different</b> variable to set. The code is the same as the code below:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(set (quote delete-old-versions) -1)
</pre>
</div>

<p>
&#x2026; but the <code>setq</code> version is shorter, so everyone uses that instead. This is also why you should be careful to type <code>setq</code> instead of <code>set</code>, as <code>set</code> refers to a different function. If you accidentally use <code>set</code> instead, you'll usually see something like a <code>Wrong type argument: symbolp</code>, <i>value</i>
</p>

<p>
To see the documentation for a variable, use <code>F1 v</code> (<code>describe-variable</code>) and type in the variable name. The variable name is the first argument to <code>setq</code>, so you would type in <code>F1 f delete-old-versions</code>. 
</p>

<p>
You can customize many variables through the <code>M-x customize</code> interface, but you'll most often see people sharing their configuration with Emacs Lisp code instead. It can be shorter to say "Add this code to your init.el" than it is to say "Use <code>M-x customize-variable</code> to change the <code>user-email-address</code> value", especially if there are lots of options to change. Not everything can be changed through the Customize interface, too. Emacs Lisp is more powerful, and it's easier to read afterwards. I tend to use <code>M-x customize</code> to explore, but I use Emacs Lisp code to set things up.
</p>

<p>
Like the way there are tons of functions, there are also tons of variables, and you can discover interesting variables using the same techniques: reading other people's code, exploring, etc. 
</p>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">How to set buffer-local variables</h2>
<div class="outline-text-2" id="text-7">
<p>
Some variables are <b>buffer-local</b>. This means that the value in one buffer (or file) is separate from the values in other buffers. To find out if a variable is local to a buffer, use <code>F1 v</code> (<code>describe-variable</code>) to look at the documentation for that variable. For example, the documentation for <code>tab-width</code> has "Automatically becomes buffer-local when set".
</p>

<p>
You can set the default value of a buffer-local variable with <code>setq-default</code>. The following code sets the tab width to 2 by default:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq-default tab-width 2)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">How to set more complex variables</h2>
<div class="outline-text-2" id="text-8">
<p>
Some variables contain lists of data. Here's an example:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq backup-directory-alist '((<span class="org-string">"."</span> . <span class="org-string">"~/.emacs.d/backups"</span>)))
</pre>
</div>

<p>
This is one of the things people usually want to change right away. By default, Emacs saves backup files in the current directory. These are the files ending in <code>~</code> that are cluttering up your directory lists. This code stashes them in <code>~/.emacs.d/backups</code>, where you can find them with <code>C-x C-f</code> (<code>find-file</code>) when you need to.
</p>

<p>
<code>alist</code> stands for <b>association list</b>. Each entry in the list is
enclosed in (&#x2026;). The first part of the list is the key that is used
to look it up, like the way a dictionary has words. The second part of
the list is the value that Emacs uses, like the definitions in a dictionary.
If you're curious, the <a href="http://www.gnu.org/software/emacs/manual/html_node/elisp/Association-Lists.html">Emacs Lisp reference manual</a> has more details.
</p>
</div>
</div>
