emacs-lisp-tutorial.org
** How to load libraries
	 :LOGBOOK:
	 CLOCK: [2014-04-18 Fri 15:17]--[2014-04-18 Fri 15:38] =>  0:21
	 :END:
	 :PROPERTIES:
	 :Effort:   1:00
	 :END:

Emacs has a lot of libraries. To save memory and to simplify operation, not all of them are loaded at startup. In addition to the libraries that are built into Emacs, you can also download packages and Emacs Lisp files, save them to a directory that Emacs can find, and load them.

Here is one way to load the code from an Emacs Lisp file.

#+begin_src emacs-lisp
(load-file "~/.emacs.secrets")
#+end_src

If the file doesn't exist, you'll get an error. You can check if it exists with:

#+begin_src emacs-lisp
  (if (file-exists-p "~/.emacs.secrets")
      (load-file "~/.emacs.secrets"))
#+end_src

If you use your Emacs configuration on multiple systems, you might want to load some configuration based on the name of the system you're on. For example:

#+begin_src emacs-lisp
  (if (file-exists-p (concat "~/.emacs.d/" (system-name) ".el"))
      (load-file (concat "~/.emacs.d/" (system-name) ".el")))
#+end_src

To find out which file the code is looking for, you can put your point *after* the closing =)= for in =.el")= (so it's on the second parentheses) and then type =C-x C-e= (=eval-last-sexp=). That will display the result of the expression in your echo area.

=load-file= loads a specified file if you know its path. For libraries, though, it's easier to use =require=. Here's an example that loads the =eldoc= library and turns on the mode. Eldoc displays information about Emacs Lisp functions or variables in the minibuffer when you move your point.

#+begin_src emacs-lisp
  (require 'eldoc)
  (eldoc-mode)
#+end_src

=require= takes the name of the feature to load. Here, it's ='eldoc=. the quotation mark before it means that it should be treated as a literal symbol, not as a variable to look at for a value. If this features has already been loaded, =require= does nothing. If not, =require= searches through the list of directories in =load-path= for an Emacs Lisp file with that name and which provides that feature. 

If you've downloaded the Emacs Lisp file or package on your own, though, you'll want to add its directory to the load path. See [[How to add to lists]] for details.

** How to add to lists
	 :LOGBOOK:
	 CLOCK: [2014-04-18 Fri 15:38]--[2014-04-18 Fri 15:45] =>  0:07
	 :END:
	 :PROPERTIES:
	 :Effort:   1:00
	 :END:

=add-to-list= is a straightforward way to add an item to a list. Here's an example of adding something to =load-path=, which controls where Emacs looks for packages or features to load:

#+begin_src emacs-lisp
(add-to-list 'load-path "~/elisp")
#+end_src

If you want to add to the end of the list, you can specify =t= as the optional APPEND argument, which is the third argument in the list.

#+begin_src emacs-lisp
(add-to-list 'load-path "~/elisp/sample-mode" t)
#+end_src

=add-to-list= adds an item only if it doesn't already exist. The list must already be defined. If you try to add an item to a list that does not exist yet, you'll get the following error: =Symbol's value as variable is void:= /listname/. Make sure you load the feature before you add to any lists defined in that feature.

If you want to always add something to the beginning of the list, you can delete it from the list and then add it back.

#+begin_src emacs-lisp
(setq load-path (delete "~/elisp" load-path))
(add-to-list 'load-path "~/elisp"))
#+end_src

If you don't mind duplicates (or you want them), you can use =cons= instead. =cons= constructs a *cons cell*, which is the data structure that makes up lists. For more information about cons, see the Emacs Lisp Intro section on [[http://www.gnu.org/software/emacs/manual/html_node/eintr/car-cdr-_0026-cons.html][car, cdr, cons: Fundamental Functions]].

#+begin_src emacs-lisp
(setq load-path (cons "~/elisp" load-path))
#+end_src

** How to add package archives - to be written
** How to add hooks - to be written

** How to set up your own keybord shortcuts - to be written
** How to define your own functions - to be written
** How to prompt for information - to be written
** How to change existing functions with advice - to be written

(c) 2014 Sacha Chua - Creative Commons Attribution License (feel free to use, share, remix)

