emacs-lisp-tutorial.html
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">How to load libraries</h2>
<div class="outline-text-2" id="text-9">
<p>
Emacs has a lot of libraries. To save memory and to simplify operation, not all of them are loaded at startup. In addition to the libraries that are built into Emacs, you can also download packages and Emacs Lisp files, save them to a directory that Emacs can find, and load them.
</p>

<p>
Here is one way to load the code from an Emacs Lisp file.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(load-file <span class="org-string">"~/.emacs.secrets"</span>)
</pre>
</div>

<p>
If the file doesn't exist, you'll get an error. You can check if it exists with:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span class="org-keyword">if</span> (file-exists-p <span class="org-string">"~/.emacs.secrets"</span>)
    (load-file <span class="org-string">"~/.emacs.secrets"</span>))
</pre>
</div>

<p>
If you use your Emacs configuration on multiple systems, you might want to load some configuration based on the name of the system you're on. For example:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span class="org-keyword">if</span> (file-exists-p (concat <span class="org-string">"~/.emacs.d/"</span> (system-name) <span class="org-string">".el"</span>))
    (load-file (concat <span class="org-string">"~/.emacs.d/"</span> (system-name) <span class="org-string">".el"</span>)))
</pre>
</div>

<p>
To find out which file the code is looking for, you can put your point <b>after</b> the closing <code>)</code> for in <code>.el")</code> (so it's on the second parentheses) and then type <code>C-x C-e</code> (<code>eval-last-sexp</code>). That will display the result of the expression in your echo area.
</p>

<p>
<code>load-file</code> loads a specified file if you know its path. For libraries, though, it's easier to use <code>require</code>. Here's an example that loads the <code>eldoc</code> library and turns on the mode. Eldoc displays information about Emacs Lisp functions or variables in the minibuffer when you move your point.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span class="org-keyword">require</span> '<span class="org-constant">eldoc</span>)
(eldoc-mode)
</pre>
</div>

<p>
<code>require</code> takes the name of the feature to load. Here, it's ='eldoc=. the quotation mark before it means that it should be treated as a literal symbol, not as a variable to look at for a value. If this features has already been loaded, <code>require</code> does nothing. If not, <code>require</code> searches through the list of directories in <code>load-path</code> for an Emacs Lisp file with that name and which provides that feature. 
</p>

<p>
If you've downloaded the Emacs Lisp file or package on your own, though, you'll want to add its directory to the load path. See <a href="#sec-10">How to add to lists</a> for details.
</p>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">How to add to lists</h2>
<div class="outline-text-2" id="text-10">
<p>
<code>add-to-list</code> is a straightforward way to add an item to a list. Here's an example of adding something to <code>load-path</code>, which controls where Emacs looks for packages or features to load:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-to-list 'load-path <span class="org-string">"~/elisp"</span>)
</pre>
</div>

<p>
If you want to add to the end of the list, you can specify <code>t</code> as the optional APPEND argument, which is the third argument in the list.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-to-list 'load-path <span class="org-string">"~/elisp/sample-mode"</span> t)
</pre>
</div>

<p>
<code>add-to-list</code> adds an item only if it doesn't already exist. The list must already be defined. If you try to add an item to a list that does not exist yet, you'll get the following error: <code>Symbol's value as variable is void:</code> <i>listname</i>. Make sure you load the feature before you add to any lists defined in that feature.
</p>

<p>
If you want to always add something to the beginning of the list, you can delete it from the list and then add it back.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq load-path (delete <span class="org-string">"~/elisp"</span> load-path))
(add-to-list 'load-path <span class="org-string">"~/elisp"</span>))
</pre>
</div>

<p>
If you don't mind duplicates (or you want them), you can use <code>cons</code> instead. <code>cons</code> constructs a <b>cons cell</b>, which is the data structure that makes up lists. For more information about cons, see the Emacs Lisp Intro section on <a href="http://www.gnu.org/software/emacs/manual/html_node/eintr/car-cdr-_0026-cons.html">car, cdr, cons: Fundamental Functions</a>.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq load-path (cons <span class="org-string">"~/elisp"</span> load-path))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11">How to add package archives - to be written</h2>
</div>
<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12">How to add hooks - to be written</h2>
</div>

<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13">How to set up your own keybord shortcuts - to be written</h2>
</div>
<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14">How to define your own functions - to be written</h2>
</div>
<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15">How to prompt for information - to be written</h2>
</div>
<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16">How to change existing functions with advice - to be written</h2>
<div class="outline-text-2" id="text-16">
<p>
(c) 2014 Sacha Chua - Creative Commons Attribution License (feel free to use, share, remix)
</p>
</div>
</div>
</div>
<div id="postamble" class="status">

<style type="text/css">
.back-to-top {
    position: fixed;
    bottom: 2em;
    right: 0px;
    text-decoration: none;
    color: #000000;
    background-color: rgba(235, 235, 235, 0.80);
    font-size: 12px;
    padding: 1em;
    display: none;
}

.back-to-top:hover {    
    background-color: rgba(135, 135, 135, 0.50);
}
</style>

<div class="back-to-top">
<a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a>
</div>

<script type="text/javascript">
    var offset = 220;
    var duration = 500;
    jQuery(window).scroll(function() {
        if (jQuery(this).scrollTop() > offset) {
            jQuery('.back-to-top').fadeIn(duration);
        } else {
            jQuery('.back-to-top').fadeOut(duration);
        }
    });
</script>
</div>
</body>
</html>
